app/controllers/backend/categories_controller.rb

  def update
    if @category.update(category_params)
---
UPDATE `categories` SET `name` = 'Libreria', `updated_at` = '2019-11-09 00:53:41' WHERE `categories`.`id` = 3