app/controllers/backend/products_controller.rb

UPDATE `products` SET `updated_at` = '2019-11-10 17:41:46' WHERE `products`.`id` = 16
---
    def update
      @product.update product_params