app/controllers/backend/products_controller.rb

SELECT COUNT(*) FROM `products`
SELECT `products`.* FROM `products`
---
  def index
  #  @presenter = ProductPresenter.new(params)
    @products = Product.paginate(page: params[:page], per_page: 5)

INSERT INTO `products` (`name`, `description`, `internalCode`, `praice`, `cost`, `created_at`, `updated_at`, `category_id`) VALUES ('Peluche ', 'nwwnsk', 9, 222.0, 22.0, '2019-11-10 22:48:46', '2019-11-10 22:48:46', 2)
---
  def create
    @product = Product.new(product_params)

    if @product.save

UPDATE `products` SET `updated_at` = '2019-11-10 17:39:59' WHERE `products`.`id` = 15
---
  def update
    if @product.update(product_params)