app/controllers/backend/tags_controller.rb

SELECT `tags`.* FROM `tags`
---
  def index
    @tags = Tag.all

SELECT  `tags`.* FROM `tags` WHERE `tags`.`id` = 1 LIMIT 1
---
  def edit
    @tag = Tag.find(params[:id])

SELECT  `tags`.* FROM `tags` WHERE `tags`.`id` = 6 LIMIT 1
DELETE FROM `tags` WHERE `tags`.`id` = 6
---
  def destroy
    @tag = Tag.find(params[:id])
    @tag.destroy