app/views/backend/products/_form.html.erb

SELECT `categories`.* FROM `categories`
---
      <%= f.label :category_id, 'Categoria' %>
      <%= f.collection_select :category_id, Category.all, :id, :name, {}, class: 'form-control' %>

SELECT `tags`.* FROM `tags`
---
      <%= f.label :tag_id, 'Etiqueta' %>
      <%= f.collection_select :tag_id, Tag.all, :id, :name, {}, class: 'form-control' %>